Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: In case you're not familiar with the "regular" Version 8 regex routines, here are the pattern-matching rules not described above.
es_es: En caso de que no esté familiarizado con la versión 8 "normal" de las rutinas regex, aquí están las reglas de coincidencia de patrones no descritas anteriormente.

source: =item C<S{REPEAT_COUNT}>
es_es: =item C<S{CONTADOR_REPETICIÓN}>

source: perl5135delta Perl changes in version 5.13.5
es_es: perl5135delta Cambios en la versión 5.13.5

source: You can combine several regexps like this to process a string part-by-part, doing different actions depending on which regexp matched.
es_es: Puede combinar varias expresiones regulares como ésta para procesar una cadena parte por parte, haciendo diferentes acciones dependiendo de la expresión regular coincidente.

source: C<continue> is actually a flow control statement rather than a function.
es_es: C<continue> es realmente una instrucción de control de flujo en lugar de una función.

source: This is used by C<AUTOLOAD> subroutines that wish to load another subroutine and then pretend that the other subroutine had been called in the first place (except that any modifications to C<@_> in the current subroutine are propagated to the other subroutine.) After the C<goto>, not even C<caller> will be able to tell that this routine was called first.
es_es: Esto se usa por subrutinas C<AUTOLOAD()> que desean cargar otra subrutina y fingen que ésta otra subrutina ha sido llamada en primer lugar (excepto que cualquier modificación a C<@_> en la subrutina actual se propaga a la otra). Después del C<goto>, ni siquiera C<caller()> será capaz de decir qué rutina fue llamada en primer lugar.

source: You'll probably first have to say
es_es: Probablemente primero querrá escribir

source: F<s2p> run on C<s/foo/bar> will produce a Perl program based around this:
es_es: Si se ejecuta F<s2p> sobre C<s/foo/bar>, generará un programa Perl basado en el código siguiente:

source: It contains functions that are no longer used in the perl core, but that remain available for binary or source compatibility reasons.
es_es: Contiene las funciones que ya no se utilizan en el núcleo de perl, pero que siguen estando disponibles por motivos de compatibilidad binaria o de código fuente.

source: $child_pid = open(FROM_KID, "|-") // die "can't fork: $!";
es_es: $child_pid = open(DESDE_EL_HIJO, "|-") // die "no puedo hacer fork: $!";

source: The type of bracket (square or curly) governs whether it's an array or a hash being looked at.
es_es: El tipo de carácter (corchete o llave) indica si se trata de un array o un hash.

source: division preserving 64-bit integers
es_es: la división preserva los enteros de 64 bits

source: Returns a 13-element list giving the status info for a file, either the file opened via FILEHANDLE or DIRHANDLE, or named by EXPR.
es_es: Devuelve una lista de 13 elementos dando la información de estado de un archivo, tanto si el archivo ha sido abierto a través de IDENTIFICADOR_ARCHIVO o IDENTIFICADOR_DIR, o nombrado por la EXPR.

source: B<will> match, it will B<not> set $1.
es_es: B<habrá> coincidencia, pero B<no> actualizará $1.

source: Simplified implementation
es_es: Implementación simplificada

source: =item C<(?=pattern)> X<(?=)> X<look-ahead, positive> X<lookahead, positive>
es_es: =item C<(?=patrón)> X<(?=)> X<consiguiente, positivo> X<consiguiente, positivo>

source: MIME::Base64 upgraded to version 3.05
es_es: MIME::Base64 actualizado a la versión 3.05

source: The Perl malloc (C<-Dusemymalloc>) does not work at all in Mac OS X. This is not that serious, though, since the native malloc works just fine.
es_es: El malloc Perl (C<-Dusemymalloc>) no funciona en absoluto en Mac OS X. Sin embargo, esto no es tan grave, debido a que el malloc nativo funciona muy bien.

source: @myarray = (5, 50, 500, 5000);
es_es: @miarray = (5, 50, 500, 5000);

source: C<Devel::DProf> upgraded to version 20050603.00
es_es: C<Devel::DProf> actualizado a la versión 20050603.00

source: Win32: 4-arg select was broken
es_es: Win32: el select() de 4 argumentos estaba roto

source: s/\w/$& x 2/eg; # yields 'aabbcc 224466xxyyzz'
es_es: s/\w/$& x 2/eg; # queda como 'aabbcc 224466xxyyzz'

source: Similarly, for repeated C<m/()/g> the second-best match is the match at the position one notch further in the string.
es_es: Del mismo modo, para los repetidos C<m/()/g> la segunda mejor coincidencia es la coincidencia en la posición de una muesca más allá en la cadena.

source: For example, 0xFF does not caselessly match the character at 0x178, C<LATIN CAPITAL LETTER Y WITH DIAERESIS>, because 0xFF may not be C<LATIN SMALL LETTER Y WITH DIAERESIS> in the current locale, and Perl has no way of knowing if that character even exists in the locale, much less what code point it is.
es_es: Por ejemplo, 0xFF no coincide, sin tener en cuenta el tamaño de caja, con el carácter 0x178, C<LATIN CAPITAL LETTER Y WITH DIAERESIS>, porque 0xFF quizás no sea C<LATIN SMALL LETTER Y WITH DIAERESIS> en la región actual, y Perl no tiene manera de saber si ese carácter incluso existe en la región, y mucho menos qué punto de código es.

source: That's why you should now invoke it as C<CORE::dump()>, if you don't want to be warned against a possible typo.
es_es: Y es por esto que debe invocarlo como C<CORE::dump()>, si no quiere recibir un aviso de que posiblemente ha cometido una falta ortográfica.

source: perlmroapi - Perl method resolution plugin interface
es_es: perlmroapi - Interfaz de complementos: resolución de métodos

source: If FILEHANDLE is an expression, the value is taken as an indirect filehandle, generally its name.
es_es: Si el IDENTIFICADOR_ARCHIVO es una expresión, el valor es tomado como un identificador de archivo indirecto, generalmente su nombre.

source: If you are an implementor, see L<perlapi/PL_keyword_plugin> for the mechanism.
es_es: Si es usted un implantador, mire L<perlapi/PL_keyword_plugin> para informarse sobre este mecanismo.

source: Be consistent with existing modules.
es_es: Sea consistente con los módulos existentes.

source: When a match is successful, the C<$REGMARK> variable will be set to the name of the most recently executed C<(*MARK:NAME)> that was involved in the match.
es_es: Cuando una coincidencia tiene éxito, la variable C<$REGMARK> se establecerá al nombre de C<(*MARK:NOMBRE)> más recientemente ejecutado que participó en la coincidencia.

source: Available on 64 bit OpenVMS 8.2 and later.
es_es: Disponible en OpenVMS 8.2 64 bit y siguientes.

source: the compiler will precompute the number which that expression represents so that the interpreter won't have to.
es_es: el compilador precalculará el número que representa esa expresión para que el intérprete no tenga que hacerlo.

source: $success;
es_es: $exito;

source: C<XSLoader> 0.06 incorporated; small optimisation for calling C<bootstrap_inherit()> and documentation enhancements.
es_es: C<XSLoader> 0.06 incorporado; pequeña optimización en la llamada a C<bootstrap_inherit()> y mejoras en la documentación.

source: The internal message loop executed by perl during blocking operations sometimes interfered with messages that were external to Perl.
es_es: El bucle de mensajes interno ejecutado por perl durante las operaciones de bloqueo a veces interfiere con los mensajes que eran externos a Perl.

source: This is just like the C<m/PATTERN/> search, except that it matches only once between calls to the reset() operator.
es_es: Esto es igual que la búsqueda C<m/patrón/>, salvo que coincide una sola vez entre llamadas al operador reset().

source: For example, the template C<x[L]> skips as many bytes as in a packed long, and the template C<"$t X[$t] $t"> unpacks twice whatever $t (when variable-expanded) unpacks.
es_es: Por ejemplo, la plantilla C<x[L]> salta tantos bytes como en un largo empaquetado, y la plantilla C<"$t X[$t] $t"> desempaqueta dos veces lo que $t desempaquete (cuando se expanda la variable).

source: =head1 NAME X<syntax>
es_es: =head1 NOMBRE X<syntax> X<sintaxis>

source: Tru64 can now build Perl with the newer Berkeley DBs.
es_es: Tru64 ahora compila Perl con las nuevas base de datos Berkeley.

source: It doesn't make much sense to decode a PNG image into a text string.
es_es: (por ejemplo, no tiene sentido descodificar una imagen PNG en una cadena de texto).

source: eval '$answer ='; # sets $@
es_es: eval '$respuesta ='; # actualiza $@

source: This fixed regexps of the form /...(??{...;$x})/ to no longer ignore changes made to $x.
es_es: Esto arregla expresiones regulares de la forma /...(??{...;$x})/ para que deje de ignorar los cambios realizados en $x.

source: =item Functions for real @ARRAYs X<array>
es_es: =item Funciones para @ARRAY reales X<array>

# if (@an_array) { print "has array elements " }
source: if (@an_array) { print "has array elements\n" }
es_es: if (@un_array) { print "tiene elementos array\n" }

source: Tests for the absolute basic functionality of Perl.
es_es: Pruebas de funcionalidad básica de Perl.

source: \e escape (think troff) (ESC)
es_es: \e escape (como en troff) (ESC)

source: =item eval BLOCK
es_es: =item eval BLOQUE

source: This patch removes the deprecation note.
es_es: Este parche elimina la nota de desaprobación.

source: =item unpack TEMPLATE,EXPR X<unpack>
es_es: =item unpack PLANTILLA,EXPR X<unpack>

source: You might want to keep these desktop references close by your keyboard:
es_es: Es probable que desee tener estas referencias a mano:

source: There are also many other sub-domains for special topics like learning Perl, Perl news, jobs in Perl, such as:
es_es: Además, existen muchos subdominios dedicados a temas específicos, como el aprendizaje de Perl, noticias sobre Perl o puestos de trabajo para programadores Perl. Por ejemplo:

source: Code references with an empty prototype are no longer treated specially.
es_es: Referencias a código con un prototipo vacío ya no son tratados de forma especial.

source: DBNAME is the name of the database (without the F<.dir> or F<.pag> extension if any).
es_es: NOMBREDB es el nombre de la base de datos (sin la extensión F<.dir> o F<.pag> si las tuviera).

source: Arguments are usually formatted to be only as wide as required to display the given value.
es_es: Los argumentos son por lo general formateados para ser sólo tan amplios como para mostrar el valor dado.

source: (.*?)(\d+)$ <I have 2 numbers: > <53147>
es_es: (.*)(\d+)$ <Tengo 2 números: 5314> <7>

source: For Module::Build you would use the C<make test> equivalent C<perl Build test>.
es_es: Para Module::Build debe utilizar el equivalente de C<make test>: C<perl Build test>.

source: Now provides numeric macros and meaningful C<Exporter> tags.
es_es: Ahora ofrece macros numéricas y etiquetas C<Exporter> más explicativas.

source: Apart from the behavior described above, Perl does not expand multiple levels of interpolation.
es_es: Además de los comportamientos descritos anteriormente, Perl no expande múltiples niveles de interpolación.

source: So if you're expecting a single value from a glob, it is much better to say
es_es: Así que si está esperando un único valor de una expansión, es mucho mejor escribir

source: '1' may actually be any positive integer.
es_es: '1' puede ser cualquier entero positivo.

source: Usually it gets it right, but if it doesn't it won't realize something is wrong until it gets to the C<}> and encounters the missing (or unexpected) comma.
es_es: Por lo general, lo hace bien, pero si no, no se dará cuenta de que algo anda mal hasta que llega a la C<}> y se encuentra con la omisión de (o inesperada) coma.

source: On some Unixes, select(2) may report a socket file descriptor as "ready for reading" even when no data is available, and thus any subsequent C<read> would block.
es_es: En algunos sistemas Unix, select(2) puede informar de un descriptor de archivo I<socket> como "listo para leer" incluso cuando no hay datos disponibles, y por lo tanto un posterior C<read> producirá un bloqueo.

source: \B Match except at a word boundary
es_es: \B Coincide con cualquier cosa excepto límite de palabra

source: 3.14> will return two elements in list context.
es_es: 3,14> devolverá dos elementos en el contexto lista.

source: TIESCALAR classname, LIST
es_es: TIESCALAR clase, LISTA

source: e Evaluate the right side as an expression.
es_es: e Evalúa el lado derecho como una expresión.

source: Returns an uppercased version of EXPR.
es_es: Devuelve una versión de EXPR, en mayúsculas.

source: for the reason).
es_es: para ver la razón).

source: C<Math::Complex> upgraded to version 1.35
es_es: C<Math::Complex> actualizada a la versión 1.35

source: For example, breaking the single input byte C<chr(0x36)> into two groups gives a list C<(0x6, 0x3)>; breaking it into 4 groups gives C<(0x2, 0x1, 0x3, 0x0)>.
es_es: Por ejemplo, rompiendo el byte de entrada C<chr(0x36)> en dos grupos da una lista C<(0x6, 0x3)>; dividiéndolo en 4 grupos da C<(0x2, 0x1, 0x3, 0x0)>.

source: =head2 Variable scoping
es_es: =head2 Ámbito de las variables

source: $a $b Type of Match Implied Matching Code
es_es: $a $b Tipo de Coincidencia Código similar

source: Versions prior to perl5.004 had serious security problems with buffer overflows, and in some cases have CERT advisories (for instance, http://www.cert.org/advisories/CA-1997-17.html ).
es_es: En las versiones anteriores a perl5.004 había problemas de seguridad graves con desbordamiento del búfer y, en algunos casos, notificaciones del CERT (por ejemplo, http://www.cert.org/advisories/CA-1997-17.html).

source: Thus
es_es: Por lo tanto

source: That is, the forms without a BLOCK are operative through the end of the current scope, just like the C<my>, C<state>, and C<our> operators.
es_es: Es decir, las formas sin un BLOQUE son operativas hasta el final del ámbito actual, al igual que los operadores C<my>, C<state> y C<our>.

source: chmod 0755, @executables;
es_es: chmod 0755, @ejecutables;

source: The following single statement:
es_es: La simple declaración siguiente:

source: This aspect of C<keys> is considered highly experimental.
es_es: Este aspecto de C<keys> es considerado altamente experimental.

source: warn "not an integer" unless /^-?\d+$/; # rejects +3
es_es: warn "no es un entero" unless /^-?\d+$/; # rechaza +3

source: Strings created with C<vec> can also be manipulated with the logical operators C<|>, C<&>, C<^>, and C<~>.
es_es: Cadenas creadas con C<vec> también se pueden manipular con los operadores lógicos C<|>, C<&>, C<^>, y C<~>.

source: perlvms Perl notes for VMS
es_es: perlvms Notas para VMS

source: =item chmod LIST X<chmod> X<permission> X<mode>
es_es: =item chmod LISTA X<chmod> X<permission> X<mode> X<permisos> X<modo>

source: Also note that the C<-x> and C<-X> may under this pragma return true even if there are no execute permission bits set (nor any extra execute permission ACLs).
es_es: Note también que C<-x> y C<-X> pueden, bajo este pragma, devolver valores verdaderos incluso si los bits de permiso de ejecución no están puestos (ni cualquier permiso ACL extra de ejecución).

source: =item C<< \k'NAME' >>
es_es: =item C<< \k'NOMBRE' >>

source: Manual error checking can be done this way:
es_es: Comprobación manual de errores se puede hacer así:

source: Opening curly on same line as keyword, if possible, otherwise line up.
es_es: Llave de apertura en la misma línea que la palabra reservada, si es posible, o si no, alineada en vertical con ella.

source: Perl comes with a profiler, the F<Devel::DProf> module.
es_es: Perl incluye un perfilador, el módulo F<Devel::DProf>.

source: Also, the ordering of hash keys has always been, and continues to be, affected by the insertion order.
es_es: Además, el ordenamiento de las claves de un hash siempre ha sido, y sigue siendo, afectado por el orden de la inserción de los elementos.

source: Returns the undefined value if the array is empty, although this may also happen at other times.
es_es: Devuelve el valor indefinido si el array está vacío, aunque esto también puede suceder en otras situaciones.

source: $sentence =~ s{$quoted_substring}{big bad wolf};
es_es: $instruccion =~ s{$subcadena_escapada}{gran lobo malo};

source: C<LDLOADLIBS> is an environment variable used by the linker to link modules C</ext> modules to glibc.
es_es: C<LDLOADLIBS> es una variable de entorno usada por el enlazador para enlazar módulos C</ext> a glibc.

source: Note that the fcntl(2) emulation of flock(3) requires that FILEHANDLE be open with read intent to use LOCK_SH and requires that it be open with write intent to use LOCK_EX.
es_es: Note que la emulación de fcntl(2) de flock(3) requiere que IDENTIFICADOR_ARCHIVO sea abierto con intención de leer para usar LOCK_SH y requiere ser abierto con intención de escribir para usar LOCK_EX.

source: $flags = fcntl(REMOTE, F_SETFL, $flags | O_NONBLOCK) or die "Can't set flags for the socket: $!\n";
es_es: $flags = fcntl(REMOTE, F_SETFL, $flags | O_NONBLOCK) or die "No puedo poner los flags para el socket: $!\n";

source: Examples of use
es_es: Ejemplos de uso

source: Some systems defined C<pipe> in terms of C<socketpair>, in which a call to C<pipe(Rdr, Wtr)> is essentially:
es_es: Algunos sistemas definen C<pipe> en términos de C<socketpair>, en el que una llamada a C<pipe(Rdr, Wtr)> es esencialmente:

source: (Perl's prefix dereferencing operators are typed: $, @, %, and &.)
es_es: (Los operadores de desreferencia de Perl están tipificados: $, @, %, y &).

source: Examples:
es_es: Ejemplos:

source: POD formatting errors in the documentation fixed
es_es: Arreglados errores de formateo en la documentación POD

source: See the example in L<perlfunc/eof> for how to reset line numbers on each file.
es_es: Vea el ejemplo en L<perlfunc/eof> de cómo restablecer los números de línea en cada archivo.

source: However, as soon as the matching engine sees that there's no whitespace following the "Foo" that it had saved in $1, it realizes its mistake and starts over again one character after where it had the tentative match.
es_es: Sin embargo, tan pronto como el motor de coincidencias ve que no hay espacios en blanco después de "Come" que había guardado en $1, se da cuenta de su error y comienza de nuevo un carácter después de donde había intentado coincidir.

source: To get the last two digits of the year (e.g., "01" in 2001) do:
es_es: Para obtener los dos últimos dígitos del año (ej., "01" en 2001) hacer:

source: You may also use a signal name in quotes.
es_es: Puede usar también nombres de señales entrecomilladas.

source: The C<:encoding> also implicitly pushes on top of itself the C<:utf8> layer because internally Perl operates on UTF8-encoded Unicode characters.
es_es: C<:encoding> también se coloca, implícitamente, por encima de la capa C<:utf8> porque Perl, internamente, opera con caracteres Unicode codificados en UTF-8.

source: Default is a 16-bit checksum.
es_es: El valor predeterminado es una suma de comprobación de 16-bit.

source: This means that it short-circuits: the right expression is evaluated only if the left expression is false.
es_es: Esto significa que cortocircuita: es decir, la expresión de la derecha sólo se evalúa si la expresión de la izquierda es falsa.

source: a subroutine or method call
es_es: una subrutina o llamada a un método

source: DOMAIN, TYPE, and PROTOCOL are specified the same as for the syscall of the same name.
es_es: DOMINIO, TIPO, y PROTOCOLO son especificados de la misma manera que la llamada del sistema del mismo nombre.

source: The copy of the Unicode Character Database included in Perl 5.9 has been updated to 4.1.0.
es_es: La copia de la base de datos de caracteres Unicode incluidos en Perl 5.9 ha sido actualizado a la 4.1.0.

source: The code above uses SDBM_File, but it will work with any of the DBM modules.
es_es: El código anterior usa SDBM_File, pero funcionará igual con todos los módulos DBM.

source: while ( ! eof($fh) ) { defined( $_ = <$fh> ) or die "readline failed for $arg: $!"; ...
es_es: while ( ! eof($fh) ) { defined( $_ = <$fh> ) or die "readline falló para $arg: $!"; ...

source: In the Internet domain, each address is four bytes long; you can unpack it by saying something like:
es_es: En el dominio de Internet, cada dirección son cuatro bytes de longitud; puede desempaquetarlos diciendo algo como:

source: -T File is an ASCII text file (heuristic guess).
es_es: -T Archivo es un archivo de texto ASCII (por una suposición heurística).

source: "\xq" "\x00q" yes
es_es: "\xq" "\x00q" sí

source: For larger ordinals, either use C<\o{}> , or convert to something else, such as to hex and use C<\x{}> instead.
es_es: Para ordinales más grandes, puede usar C<\o{}>, o convertirlo a otra cosa, como por ejemplo, a hexadecimal y usar C<\x{}> en su lugar.

source: This can be used to determine which branch of a pattern was matched without using a separate capture group for each branch, which in turn can result in a performance improvement, as perl cannot optimize C</(?:(x)|(y)|(z))/> as efficiently as something like C</(?:x(*MARK:x)|y(*MARK:y)|z(*MARK:z))/>.
es_es: Esto puede ser usado para determinar qué rama de un patrón coincidió sin necesidad de utilizar un grupo de captura separado para cada rama, que, a su vez, puede resultar en una mejora del rendimiento, ya que Perl no puede optimizar C</(?:(x)|(y)|(z))/> tan eficientemente como algo parecido a C</(?:x(*MARK:x)|y(*MARK:y)|z(*MARK:z))/>.

source: Allow building on AIX 4.2.
es_es: Se permite la compilación en AIX 4.2.

source: exist, they are bugs and reports are welcome.
es_es: hay, los errores e informes serán bienvenidos.

source: The parentheses enclose the argument list for C<print> which is evaluated (printing the result of C<$foo & 255>).
es_es: Los paréntesis encierran la lista de argumentos para C<print> que se evalúa (imprimir el resultado de C<$foo & 255>).

source: If you can't remember what mnemonic means, you've got a problem.
es_es: Si no puede recordar lo que significa un mnemónico, usted tiene un problema.

source: For a comprehensive date and time representation look at the L<DateTime> module on CPAN.
es_es: Para una completa y actualizada representación del tiempo mire en el módulo L<DateTime> en CPAN.

source: Special care has been taken to ensure that those operators Do What You Mean while not breaking old code, but some edge cases involving the empty regular expression may now parse differently.
es_es: Especial cuidado se ha tomado para garantizar que estos operadores Hagan Lo Que Queremos Decir sin romper código antiguo, pero en algunos casos extremos en los que está implicada una expresión regular vacía, pueden analizarse ahora de manera distinta.

source: This is where the notation C<${arr[$bar]}> comes handy: C</${arr[0-9]}/> is interpreted as array element C<-9>, not as a regular expression from the variable C<$arr> followed by a digit, which would be the interpretation of C</$arr[0-9]/>.
es_es: Aquí es donde la notación C<${arr[$bar]}> es muy útil: C</${arr[0-9]}/> es interpretada como un elemento de array C<-9>, no como una expresión regular desde la variable C<$arr> seguida por un dígito, que puede ser la interpretación de C</$arr[0-9]/>.

source: Tests for perl's method resolution order implementations (see L<mro>).
es_es: Pruebas de las implementaciones de orden de resolución de métodos de perl (vea L<mro>).
